In [134]:
import pandas as pd
df=pd.read_csv("income.csv")
d=d.copy()
df
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [135]:
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [136]:
df[["2010"]]

    2010
0  40933
1  57848
2  46896
3  38587
4  54283

In [137]:
s=0
for i in df["2010"]:
    s=s+i
print(s)

238547

In [138]:
s=1
for i in df["2010"]:
    s=s*i
print(s)

232596181920264525116544

In [139]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

540959

In [140]:
df["2010"].sum()

238547

In [141]:
df.iloc[4,2:].sum()#4th row and all columns

498154

In [142]:
#sum of 2005 to 2008 columns
df.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [143]:
s=0
k=df.iloc[:,2:6].sum()
for i in k:
    s=s+i
print(s)

976808

In [144]:
a=df[["2005","2006","2007","2008"]].sum()
a.sum()

976808

In [145]:
a=df.loc[0:,"2005":].sum()
a.sum()

2199422

In [146]:
a=df.iloc[0:,2:].sum()
a.sum()

2199422

In [147]:
df.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 62993, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [148]:
df.sum()#to find the total sum of indviual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [149]:
df.sum(1)#to find the sum of individual rows

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [150]:
#prod()to find the product
a=df.iloc[1:3,2:6].prod()
a.prod()

3892897880436685324

In [151]:
a=df.loc[1:3,"2005":].prod()
a.prod()

7031317092926226432

In [152]:
#mean()to find the average
#find the 2011 column avg
print(df["2011"].mean())
print(df.iloc[2,2:].mean())

48662.2
48967.88888888889

In [153]:
#median()
print(df["2011"].median())
print(df.iloc[2,2:].median())

48621.0
46914.0

In [154]:
#Combined Average Income of all states from 2005 to 2013
d=(df.iloc[:,2:].mean())
d.mean()

48876.044444444444

In [155]:
#State with highest average income in the last three years
d=df.iloc[:,8:].mean()
d.max()

50113.4

In [156]:
#State with lowest average income from 2007 to 2010(inclusive)
d=df.iloc[:,3:6].mean()
d.min()

46680.6

In [157]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [158]:
d=pd.read_csv("income.csv",index_col="State")
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [160]:
#state with highest average income in the last three years
d.iloc[:,-3:].mean(1).idxmax()

'Alaska'

In [162]:
#State with lowest average income from 2007 to 2010(inclusive)
d.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

In [165]:
#Print the list of all states in the same line with average income less than California
a=d.iloc[:,2:].mean(1)
a

State
Alabama       41623.500
Alaska        60633.500
Arizona       49433.250
Arkansas      39100.250
California    55799.875
dtype: float64

In [166]:
calavg=df.iloc[-1,2:].mean()
calavg

55350.444444444445

In [167]:
d.iloc[:,2:].mean(1)<calavg

State
Alabama        True
Alaska        False
Arizona        True
Arkansas       True
California    False
dtype: bool

In [168]:
list(d[d.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

### Print the names of states based on descending order of income in the year 2009

In [170]:
a=d.iloc[:,6]

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [171]:
b=a.sort_values(ascending=False)
b

State
Alaska        60633.500
California    55799.875
Arizona       49433.250
Alabama       41623.500
Arkansas      39100.250
dtype: float64

In [172]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

#### State with the lowest recorded income from 2005 to 2013'''

In [173]:
d.iloc[:,2:].idxmin()

2006    Arkansas
2007    Arkansas
2008    Arkansas
2009    Arkansas
2010    Arkansas
2011    Arkansas
2012    Arkansas
2013    Arkansas
dtype: object